{"meta":{"title":"Fezzker's Blog","subtitle":"个人博客","description":"blog, front-end","author":"fezzker","url":"http://www.fezzker.com/blog","root":"/blog/"},"pages":[{"title":"categories","date":"2019-04-28T15:18:34.000Z","updated":"2019-04-28T15:18:47.126Z","comments":true,"path":"categories/index.html","permalink":"http://www.fezzker.com/blog/categories/index.html","excerpt":"","text":""},{"title":"tags","date":"2019-04-28T15:11:43.000Z","updated":"2019-04-28T15:18:21.887Z","comments":true,"path":"tags/index.html","permalink":"http://www.fezzker.com/blog/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"Hello Hexo","slug":"hello-hexo","date":"2019-04-21T13:48:25.000Z","updated":"2019-05-04T14:47:01.281Z","comments":true,"path":"2019/04/21/hello-hexo/","link":"","permalink":"http://www.fezzker.com/blog/2019/04/21/hello-hexo/","excerpt":"","text":"关于博客其实想搭博客这件事儿，已经计划了很久了。 最开始是想自己动手从前端到后端完完整整的实现一遍的，这样会有很大的收获 – 对于一个前端而言。但是下班之后真的提不起劲来做这样一个硕大的工程，而且要实现一个完善可用的博客系统，需要花很长时间去开发、完善、美化。因此在种种理（jie）由（kou）下，就一直搁置了下来。 直到今年春节后，在工作环境发生了些不愉快的事，深感自身水平有限、能力不足。身处安逸区，心在焦虑区，状态很不好，又迫切的想要提升自己。但我清楚自己内驱力不足，没有实际压力就没有动力学习，因此又想起了这个“博客计划”。 定期更新博客，一来是给自己定一个实际可见的学习安排，二来也可以将学习心得落于纸面，得到一定的正反馈。虽然不能保证更新博客的压力能带来多少的紧迫感，但至少比空手投入学习要好很多。 搭建博客 搭建博客的过程十分不顺，因此我加了个 tag 叫 碎碎念，来抒发一下愤懑。 首先是博客的方案选型： 自己完整地实现一个博客系统：这个首先 pass，如果选择了这个方案，我可以想象到我往后的业余生活全搭在这上面了，况且没必要重复造轮子嘛。 用一个博客框架搭建博客：这个不错，值得考虑 使用“博客园”、“简书”等网站记录博客：作为一个有追求的前端，这也太 low 了，一点都不 geek。 在多方咨询和查询后，我选则了 Hexo，js 语言，纯静态，基本满足我的需求。没想到正式上手搭建博客就是噩梦的开始。 完成博客选型后，我准备先把服务器搞定： 18年买了一个腾讯的特价服务器一直没用，还剩一年有效期。 于是又在腾讯云买了域名，还行不贵。 搭了环境，装了 Nginx，到这为止都还算顺利。 国内服务器，域名需要备案；我人在上海，上海备案需要“居住证”，wtf？？？北京备案都不需要“居住证”。况且我搭个网站还得先证明我有在本地居住的资格？？？ 去年年底因为一些忙的不可开交的原因，没有去办理“居住证”。“租赁备案”还在有效期内，但今年年初换了个住处，不知道原“租赁备案”还是否可用。带着侥幸心理去尝试办了一下，果不其然失败了。来回查证等流程带走了两周时间。 和朋友讨论了一下，排除了几个费时费力的方案之后，准备把博客搭在国外服务器上。 货比三家之后，选则了 linode，但他家只接受境外信用卡，而且好贵，5刀/月。（这些年境外服务器商基本也都在往高端做，大多数厂商的最低价就是5刀/月。搬瓦工有稍微便宜一点点的套餐且能用支付宝，不过被朋友吐槽服务器不稳定了，vultr 试了试好像因为新人优惠套餐原因支付宝付不了） 申请了交行的“优逸白金套卡”，一周后拿到卡，结果只有一张国内的信用卡，联系了三遍客服无法解决，最后销卡了，一套流程下来又是两周。（第一次在线填写因为不知道公司电话，放弃了提交。但是交行神奇的流程设置居然是分段提交的，第二天有客户经理电话联系我补全信息，我着重强调了我需要套卡，而不是国内卡。我觉得问题十有八九出在这个客户经理身上，如果知道信息我一定要投诉！！！） 最后我的计划是找朋友代为帮我购买服务器买啥服务器，搭github完事儿，从想搭博客开始到这里已经是一个半月了，我也不急了，准备把博客内容充实一下，服务器到时候再说。 从尝试办理居住证开始，我开始了第二手打算，准备同步把博客在本地先初始化好。hexo 的上手其实比较简单啦，文档也不多。后续遇到的所有问题基本都可以总结为一句话：强迫症害死个人啊！ 找看的顺眼的主题花了我非常大的精力，前前后后试用了9个主题 Next 虽然（可能）是最方便的 Hexo 主题，但因为太没辨识度，被我 pass 了 某主题 A 是我第一个比较顺眼的主题，但是没有代码高亮，花了大力气给主题补上了 Google 的 code-prettify，随后发现这个效果太丑了，遂放弃 某主题 B 安装上之后，页面不展示且报了8个错。花了一晚上修了仨，看了看原作者的 github 两年没更新了，后面还不知道有多少坑，年久失修修个蛋，遂放弃。 现在选则的是 Hiker 主题。 原本还想接入 Comm(ent|it) 来管理评论的，研究了一下 Hiker 自带的 livere 感觉不会突然暴毙，可以安心使用，就不自己折腾了。 第一篇博客这篇博客是我搭建完成后的第一篇博客，我将对博客的用途做一下规划： 记录学习心得，包括：日常工作收获、各种学习课程的笔记等 记录生活中一些有感而发的看法。 最低限度：至少保证每周一篇。 Todos这个博客现在还是个半成品，还有不少事情要做： 修复 Categories &amp; Tags 两个目录不展现的问题 – 完成 购买服务器，绑定域名，并完成线上搭建github静态博客走起 livere 的注册，这个需要有在线网站才行；开启评论功能 END暂时就先写这些，路漫漫其修远兮，自勉。","categories":[{"name":"杂记","slug":"杂记","permalink":"http://www.fezzker.com/blog/categories/杂记/"}],"tags":[{"name":"碎碎念","slug":"碎碎念","permalink":"http://www.fezzker.com/blog/tags/碎碎念/"}]}]}